# BuiltInFailures.CutterFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutterFailures Class
BuiltInFailures Class Members See Also
---
Failures about Cutter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class CutterFailures
```

Visual Basic
---
```text
Public NotInheritable Class CutterFailures
```

Visual C++
---
```text
public ref class CutterFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..CutterFailures
# See Also
BuiltInFailures..::..CutterFailures Members
Autodesk.Revit.DB Namespace